project/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяАлгоритмКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииСвойств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтоГруппа Тогда
		// Полное имя свойств конфигурации.
		Если (ЗначениеЗаполнено(СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурации))
			Или (ЗначениеЗаполнено(СвойствоКонфигурацииКорреспондента) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурацииКорреспондента)) Тогда
			ГруппаСвойствКонфигурации = "";
			ГруппаСвойствКонфигурацииКорреспондента = "";
			Если ЗначениеЗаполнено(Родитель) Тогда
				ДанныеРодителя = Новый Структура("СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента");
				ЗаполнитьЗначенияСвойств(ДанныеРодителя, Родитель);
				ГруппаСвойствКонфигурации = СокрЛП(ДанныеРодителя.СвойствоКонфигурации);
				ГруппаСвойствКонфигурацииКорреспондента = СокрЛП(ДанныеРодителя.СвойствоКонфигурацииКорреспондента);
			КонецЕсли;
			Если ЗначениеЗаполнено(СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурации) Тогда
				ПолноеИмяСвойстваКонфигурации = ?(ПустаяСтрока(ГруппаСвойствКонфигурации), 
					"", "" + ГруппаСвойствКонфигурации + ".") + СокрЛП(СвойствоКонфигурации);
			КонецЕсли;
			Если ЗначениеЗаполнено(СвойствоКонфигурацииКорреспондента) 
				И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурацииКорреспондента) Тогда
				ПолноеИмяСвойстваКонфигурацииКорреспондента = ?(ПустаяСтрока(ГруппаСвойствКонфигурацииКорреспондента), 
					"", "" + ГруппаСвойствКонфигурацииКорреспондента + ".") + СокрЛП(СвойствоКонфигурацииКорреспондента);
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	// Авто формирование наименования.
	ПараметрыПКС = Новый Структура("ИспользоватьДляОтправки, ИспользоватьДляПолучения, ТипКонвертации");
	ЗаполнитьЗначенияСвойств(ПараметрыПКС, Владелец);
	ПараметрыПКС.Вставить("СвойствоКонфигурации", СвойствоКонфигурации);
	ПараметрыПКС.Вставить("СвойствоКонфигурацииСтрокой", СвойствоКонфигурацииСтрокой);
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваКонфигурации", ПолноеИмяСвойстваКонфигурации); 
	ПараметрыПКС.Вставить("СвойствоФормата", СвойствоФормата);
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваФормата", ПолноеИмяСвойстваФормата); 
	ПараметрыПКС.Вставить("ЭтоГруппа", ЭтоГруппа);
	ПараметрыПКС.Вставить("ИмяПараметраДляПередачи", ИмяПараметраДляПередачи);
	ПараметрыПКС.Вставить("СвойствоКонфигурацииКорреспондента", СвойствоКонфигурацииКорреспондента);
	ПараметрыПКС.Вставить("ЭтоГруппа", ЭтоГруппа);
	
	Справочники.ПравилаКонвертацииСвойств.ЗаполнитьНаименованиеПКС(Наименование, ПараметрыПКС);
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Для конвертации XML: признак ИспользуетсяАлгоритмКонвертации заполняется для служебных целей (оформление цветом в списке свойств).
	Если ПараметрыПКС.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
		ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(АлгоритмПередВыгрузкойСвойства)
			Или НЕ ПустаяСтрока(АлгоритмПриВыгрузкеСвойства) Или НЕ ПустаяСтрока(АлгоритмПослеВыгрузкиСвойства);
		Если ЭтоГруппа И НЕ ИспользуетсяАлгоритмКонвертации Тогда
			ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(АлгоритмПередОбработкойВыгрузки)
				Или НЕ ПустаяСтрока(АлгоритмПослеОбработкиВыгрузки); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ ЭтоГруппа Тогда
		Проверено = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#КонецЕсли
